# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()cur.execute("""SELECT * FROM customers 
	                                 WHERE city = 'Boston';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [4]:
cur.execute("""SELECT firstName, lastName, city, state  
               FROM employees 
               JOIN offices USING(officeCode)
               ORDER BY firstName, lastName""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [6]:
cur.execute("""SELECT contactFirstName, contactLastName,
               orderNumber, orderDate, status
               FROM customers 
               JOIN orders USING(customerNumber)""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Total number of results:', len(df))
df.head()

Total number of results: 326

  contactFirstName contactLastName  orderNumber   orderDate   status
0          Carine          Schmitt        10123  2003-05-20  Shipped
1          Carine          Schmitt        10298  2004-09-27  Shipped
2          Carine          Schmitt        10345  2004-11-25  Shipped
3             Jean            King        10124  2003-05-21  Shipped
4             Jean            King        10278  2004-08-06  Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [8]:
cur.execute("""SELECT contactFirstName, contactLastName,
               amount, paymentDate
               FROM customers 
               JOIN payments USING(customerNumber)""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Total number of results:', len(df))
df.head()

Total number of results: 273

  contactFirstName contactLastName    amount paymentDate
0          Carine          Schmitt  14571.44  2003-06-05
1          Carine          Schmitt   6066.78  2004-10-19
2          Carine          Schmitt   1676.14  2004-12-18
3             Jean            King  32641.98  2003-06-06
4             Jean            King  33347.88  2004-08-20

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [10]:
cur.execute("""SELECT orderDate, contactFirstName, contactLastName,
               quantityOrdered, productName, orderDate
               FROM customers
               JOIN orders USING(customerNumber)
               JOIN orderdetails USING(orderNumber)
               JOIN products USING (productCode)
               ORDER BY orderDate DESC""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
print('Total number of results:', len(df))
df.head()

Total number of results: 2996

,orderDate,contactFirstName,contactLastName,quantityOrdered,productName,orderDate
0,2005-05-31,Janine,Labrune,38,1962 LanciaA Delta 16V,2005-05-31
1,2005-05-31,Janine,Labrune,33,1957 Chevy Pickup,2005-05-31
2,2005-05-31,Janine,Labrune,28,1998 Chrysler Plymouth Prowler,2005-05-31
3,2005-05-31,Janine,Labrune,38,1964 Mercedes Tour Bus,2005-05-31
4,2005-05-31,Janine,Labrune,19,1926 Ford Fire Engine,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!